{
  "about": {
    "title": "Over mij",
    "pOne": "Ik ben Andreas Milants en ik ben student Toegepaste Informatica aan University College Leuven-Limburg.",
    "pTwo": "In mijn vrije tijd besteed ik de meeste tijd aan het maken van verschillende applicaties. Deze gaan van het maken van een eenvoudige website tot het uitwerken van Neural Networks.",
    "pThree": "De tijd die ik dan nog over heb, spendeer ik aan mijn twee hobby's: Chiro en voetbal. Ik ben leiding in Chiro Nemas Binkom sinds 2015 en sinds 2018 ben ik er ook groepsleiding."
  },
  "competences": {
    "title": "Skills",
    "backend_dev": {
      "title": "Backend webontwikkeling",
      "descr": "Hoog"
    },
    "frontend_dev": {
      "title": "Frontend webontwikkeling",
      "descr": "Gemiddeld"
    },
    "app_dev": {
      "title": "App ontwikkeling",
      "descr": "Gemiddeld"
    },
    "algo": {
      "title": "Algoritmen & Datastructuren",
      "descr": "Hoog",
      "second_place": "Tweede plaats Vlaamse Programmeerwedstrijd"
    },
    "databases": {
      "title": "Databanken",
      "descr": "Gemiddeld"
    },
    "level": "Niveau",
    "exp": "Ervaring"
  },
  "navigation": {
    "about": "Over mij",
    "competences": "Skills",
    "projects": "Projecten",
    "resume": "CV"
  },
  "projects": {
    "title": "Projecten",
    "abc_cooking": {
      "pOne": "In oktober 2019 nam ik deel aan een hackathon die georganiseerd werd door IBM. De business case was om een standalone app te maken voor de Apple Watch. Ons idee was om een app te maken die je kon gebruiken bij het kopen van ingrediënten en koken van een gerecht.",
      "pTwo": "Je kon gerechten kiezen uit een online databank en de app helpt je dan bij het hele proces. Van het kopen van de juiste ingrediënten in de juiste hoeveelheden tot het koken zelf.",
      "pThree": "Om een gerecht te kiezen, kon je spreken tegen je horloge en dan werd er met behulp van Watson bepaald welk gerecht je wilde maken en voor hoeveel personen.",
      "pFour": "De naam ABC-cooking komt van Appetite, Buy, Cook. Je beslist dat je \"Appetite\" hebt en kiest een gerecht. Hierna word je automatisch naar de \"Buy\" stap geleid die je daarna weer tot bij \"Cook\" brengt."
    },
    "abc_cooking2": {
      "pOne": "Voor een vak genaamd 'Mobile Applications' moest ik een mobiele app bouwen. Ik dacht meteen aan de ABC cooking horloge-app die ik eerder maakte en dacht dat dit het ideale project zou zijn. Deze keer had ik echter veel meer tijd om het helemaal uit te werken en werd het werkelijk een finished product.",
      "pTwo": "De app is helemaal gemaakt met Flutter en met Django als backend."
    },
    "arnecrush": {
      "pOne": "Arnecrush is een passieproject dat ik heb gemaakt tijdens mijn eerste jaar Toegepaste Informatica. Dit was een website waarop mijn medestudenten spelletjes konden spelen. De bedoeling was dat alle assets in deze spelletjes gebaseerd waren op leerkrachten.",
      "pTwo": "De website, database en alle games werden gehost op een raspberry pie."
    },
    "snake": {
      "pOne": "Eén van mijn eerste programmeerprojecten was deze snake AI. Het programma speelde snake met behulp van Neural Networks en verbeterde zichzelf door weights en biases van vorige generaties over te erven.",
      "pTwo": "Het hele programma is in Python geschreven. Omwille van performantie, heb ik numpy gebruikt voor het vermenigvuldigen van matrices."
    },
    "novem": {
      "pOne": "Novem is een evaluatie-instrument dat oorspronkelijk ontwikkeld is voor scholen. Het is een manier om studenten te scoren op verschillende karakterkenmerken door hen vragenlijsten te laten invullen. Een kennis heeft mij gevraagd om deze applicatie te ontwikkelen.",
      "pTwo": "Aangezien beveiliging één van de belangrijkste onderdelen was van deze applicatie, heb ik besloten de applicatie met het Django Framework te maken.",
      "pThree": "Momenteel wordt deze applicatie getest in Belgische scholen."
    },
    "ticketgang": {
      "pOne": "In augustus 2019 heb ik, samen met een andere student, aan een app gewerkt voor TicketGang.",
      "pTwo": "De app moest gebruikt worden voor het scannen van tickets aan de ingang van grote evenementen. Ze kon niet enkel gebruikt worden om deze tickets te scannen, maar ook om verschillende scan-profielen op te stellen en een scan-crew te beheren.",
      "pThree": "De app is gemaakt met Xamarin en heeft een iOS en Android versie.",
      "pFour": "In 2020 ben ik opnieuw een maand lang gaan werken bij TicketGang. Deze keer kreeg ik de opdracht om een app te bouwen om tickets aan te kopen, te reserveren, en te beheren."
    },
    "stars_4_everyone": {
      "pOne": "Op school hebben we elk semester een projectweek. Deze projectweek mochten twee teams volgens het BDD-principe werken. Ik zat in één van deze teams.",
      "pTwo": "We moesten een applicatie maken waar gebruikers sterren konden geven aan hun collega's voor hulp bij projecten. De gebruikte technologieën waren niet echt modern, wat de uitdaging des te groter maakte. Het hele project is gemaakt met Java Servlets."
    },
    "cnb": {
      "pOne": "In 2020 besloten we (Chiro Nemas Binkom) dat we toe waren aan een nieuwe website. Tot dit moment gebruikten we nog een gewone Wordpress-site, maar we wilden een betere manier voorzien om je in te kunnen schrijven als lid voor onze Chiro.",
      "pTwo": "Ik heb besloten een nieuwe website te bouwen met behulp van Django en deze te hosten op AWS.",
      "pThree": "Het project bevat een zelfgebouwd CMS, een foto-galerij applicatie, en nog vele andere features.",
      "pFourOne": "De website wordt gehost op AWS Elastic Beanstalk in een docker-omgeving. Ze zal binnenkort beschikbaar zijn op ",
      "pFourTwo": "."
    },
    "stratvision": {
      "pOne": "Als eindproject in mijn bachelorstudies maakte ik een webapplicatie voor Stratvision. Stratvision is een businessgame, die gespeeld wordt in teams van internationale studenten.",
      "pTwo": "Het doel van het project was om zoveel mogelijk functionaliteiten aanpasbaar te maken door mensen zonder technische kennis. Om dit probleem aan te pakken, bedacht ik de node-editor die je in de foto ziet. De node-editor bestaat uit verschillende type nodes die je in staat stellen een hele businessgame te ontwikkelen vanuit je browser.",
      "pThree": "Uiteraard moet je na het aanpassen van de businesslogica ook in staat zijn om dingen als  gegenereerde rapporten en grafieken aan te passen. Ook deze kunnen dus heel eenvoudig via de website aangepast worden.",
      "pFour": "Het resultaat is een volledig uitgewerkte applicatie waarbij studenten in teams een businessgame kunnen spelen. Op het einde van rondes in het spel worden er automatisch rapporten gegenereerd met behulp van de logica, die is gedefinieerd door administratoren."
    },
    "scrabble": {
      "pOne": "Vul het bord, typ je beschikbare letters onderaan en vind de oplossing die je het meeste punten oplevert!"
    }
  },
  "resume": {
    "under_header": "Software Developer - België",
    "skills": {
      "prot": "Netwerkprotocollen",
      "alg": "Algoritmen",
      "datas": "Datastructuren",
      "math": "Wiskunde",
      "teach": "Lesgeven",
      "leader": "Leiderschap",
      "stock": "De beurs"
    },
    "edu": {
      "title": "Opleiding",
      "ti": {
        "title": "Bachelor in de Toegepaste Informatica"
      },
      "fys": {
        "title": "Bachelor in de Fysica",
        "extra": "Gestopt"
      }
    },
    "work": {
      "title": "Werkervaring",
      "ticketgang": {
        "date": "Augustus 2019 & Augustus 2020",
        "description": "Verantwoordelijk voor het bouwen van 2 mobiele applicaties. Eén voor organisatoren van evenementen om tickets te scannen, en één voor klanten om tickets te kopen."
      },
      "riskconcile": {
        "date": "Maart 2021 - Nu",
        "description": "Als een full stack developer ben ik verantwoordelijk voor verschillende applicaties in zowel de front-end als backend."
      }
    },
    "ex_cur": {
      "title": "Buitenschoolse activiteiten",
      "ibm_hack": {
        "date": "Oktober 2019",
        "description": "Deelgenomen aan een hackathon, georganiseerd door IBM.  De business case was om een standalone app te maken voor de Apple Watch. We hebben een app gebouwd waarbij je kon spreken tegen je horloge om ingrediënten voor een gerecht te ontdekken, live instructies kreeg tijdens het koken en online ingrediënten kon bestellen."
      },
      "progr_comp": {
        "title": "Vlaamse Programmeerwedstrijd",
        "date": "Maart 2019",
        "description": "Tweede plaats op de Vlaamse Programmeerwedstrijd."
      },
      "teach": {
        "title": "Monitoraatlessen",
        "description": "Monitoraatlessen gegeven over assembly, bomen & grafen, web-ontwikkeling en object-georiënteerd programmeren voor eerste- en tweede-jaars studenten in de richting Toegepaste Informatica."
      },
      "chiro": {
        "description": "Groepsleiding en leiding bij Chiro Nemas Binkom."
      }
    },
    "contact": {
      "title": "Contactinformatie",
      "belg": "België"
    },
    "lang": {
      "title": "Talen",
      "nl": "Nederlands (Moedertaal)",
      "en": "Engels",
      "fr": "Frans"
    },
    "progr_lang": {
      "title": "Programmeertalen"
    },
    "fram": {
      "title": "Frameworks & Libraries"
    }
  }
}
