{
  "about": {
    "title": "Over mij",
    "pOne": "Ik ben Andreas Milants en ik ben student Toegepaste Informatica aan University College Leuven-Limburg.",
    "pTwo": "In mijn vrije tijd besteed ik de meeste tijd aan het maken van verschillende applicaties. Deze gaan van het maken van een eenvoudige website tot het uitwerken van Neural Networks.",
    "pThree": "De tijd die ik dan nog over heb, spendeer ik aan mijn twee hobby's: Chiro en voetbal. Ik ben leiding in Chiro Nemas Binkom sinds 2015 en sinds 2018 ben ik er ook groepsleiding."
  },
  "competences": {
    "matrix": "Klik hier voor de competentiematrix",
    "title": "Competenties",
    "backend_dev": {
      "title": "Backend webontwikkeling",
      "descr": "Hoog"
    },
    "frontend_dev": {
      "title": "Frontend webontwikkeling",
      "descr": "Gemiddeld"
    },
    "app_dev": {
      "title": "App ontwikkeling",
      "descr": "Gemiddeld"
    },
    "algo": {
      "title": "Algoritmen & Datastructuren",
      "descr": "Hoog",
      "second_place": "Tweede plaats Vlaamse Programmeerwedstrijd"
    },
    "databases": {
      "title": "Databanken",
      "descr": "Gemiddeld"
    },
    "level": "Niveau",
    "exp": "Ervaring"
  },
  "competencesMatrix": {
    "smallScreen": "Deze competentiematrix wordt mogelijk niet goed weergegeven op uw scherm. Gebruik een groter scherm.",
    "levels": {
      "el": "Elementair",
      "gr": "Doorgroei",
      "in": "Integratie",
      "ex": "Expert"
    },
    "level": "Niveau",
    "info": "Uitleg",
    "competences": {
      "dataHandle": {
        "name": "Gegevens behandelen",
        "rows": {
          "collect": {
            "name": "Gegevens verzamelen",
            "info": "Structuur aanbrengen in de gegevens"
          },
          "model": {
            "name": "Gegevens modelleren",
            "info": "Gegevens modelleren volgens een relevant model"
          },
          "connect": {
            "name": "Verbanden leggen",
            "info": "Vereiste relaties zelfstandig aanbrengen"
          },
          "save": {
            "name": "Gegevens opslaan",
            "info": "Gegevens opslaan en veiligheidskopies maken volgens een aangereikte procedure"
          },
          "access": {
            "name": "Gegevens ter beschikking stellen",
            "info": "Bestaande presentatievormen kennen"
          }
        }
      },
      "analyze": {
        "name": "Analyseren",
        "rows": {
          "identify": {
            "name": "Informatie-behoeften van een organisatie identificeren",
            "info": "Zelfstandig informaties omtrent de missie van een organisatie documenteren"
          },
          "translate": {
            "name": "De informatie-behoeften van een organisatie vertalen in concepten, schema's en relaties",
            "info": "Zelfstandig gebruik maken van een methodiek om gegevens te structureren"
          },
          "formulate": {
            "name": "Mogelijke IT-oplossingen documenteren / formuleren",
            "info": "Mogelijke oplossingen van gelijkaardige, bestaande problemen verzamelen"
          },
          "eval": {
            "name": "Mogelijke IT-oplossingen evalueren",
            "info": "Notie hebben van de beschikbare criteria"
          },
          "test": {
            "name": "Testprocedures opstellen voor nieuwe IT-oplossingen",
            "info": "Zelfstandig voor elk van de partijen mogelijke, concrete werkwijzen vastleggen"
          }
        }
      },
      "solve": {
        "name": "Oplossingen uitwerken",
        "rows": {
          "progr": {
            "name": "Nieuwe IT-oplossingen programmeren",
            "info": "Zelfstandig complexe algoritmes toepassen"
          },
          "impl": {
            "name": "Nieuwe IT-oplossingen implementeren",
            "info": "In gebruik stellen van de nieuwe applicatie"
          },
          "doc": {
            "name": "Nieuwe IT-oplossingen documenteren",
            "info": "Correct gedachten verwoorden"
          },
          "test": {
            "name": "Nieuwe IT-oplossingen testen",
            "info": "Valideren van de integratie"
          }
        }
      },
      "manage": {
        "name": "Beheren",
        "rows": {
          "conf": {
            "name": "IT-oplossingen configureren, beveiligen en aanpassen",
            "info": "IT-oplossingen opzetten a.d.h.v. standaard-documentatie"
          }
        }
      },
      "project": {
        "name": "Projectmatig werken",
        "rows": {
          "split": {
            "name": "Het project splitsen in taken en deeltaken",
            "info": "Inzien van het nut van eeen stapsgewijze aanpak"
          },
          "plan": {
            "name": "Planningen opstellen",
            "info": "Het belang van een tijdsplanning inzien"
          },
          "fol": {
            "name": "Een project opvolgen",
            "info": "Onder begeleiding nagaan of de opgelegde deadlines gerespecteerd worden voor een eenvoudige opdracht"
          },
          "mul": {
            "name": "In een multidisciplinair en/of multicultureel team werken, als teamlid of projectleider",
            "info": "Notie hebben van de verschillende rollen van de deelnemers in een project"
          }
        }
      },
      "comm": {
        "name": "Communiceren",
        "rows": {
          "comm": {
            "name": "Mondeling en schriftelijk communiceren in het Nederlands en minstens één vreemde taal",
            "info": "Een aantrekkelijke en motiverende schrijfstijl hanteren"
          },
          "suit": {
            "name": "De gepaste communicatietechnieken aanwenden",
            "info": "Vergader- en rapporteer-technieken toepassen"
          },
          "par": {
            "name": "Deelnemen aan vergaderingen als lid of als voorzitter",
            "info": "Vergaderingen leiden bij Chiro Nemas Binkom, lid jeugdraad Lubbeek"
          },
          "teach": {
            "name": "Mensen opleiden en begeleiden",
            "info": "Suggesties en tips formuleren"
          }
        }
      },
      "adapt": {
        "name": "Zijn eigen gedrag aanpassen",
        "rows": {
          "eval": {
            "name": "Het eigen functioneren kritisch evalueren en bijsturen",
            "info": "Tijdig zoeken naar een alternatieve oplossing/aanpak indien gekozen aanpak niet geschikt is"
          },
          "act": {
            "name": "Maatschappelijk verantwoord handelen",
            "info": "Naleven van de deontologie eigen aan de functie, rol of niveau"
          },
          "cre": {
            "name": "Creatief vernieuwend en met zin voor initiatief handelen",
            "info": "Initiatief nemen tot vernieuwingen waarbij de uitkomst niet bekend en voorspelbaar is"
          },
          "ass": {
            "name": "Assertief handelen en rekening houden met de belangen van de betrokken partijen",
            "info": "Eigen standpunten onderbouwen met argumenten"
          },
          "stress": {
            "name": "Opdrachten uitvoeren met doorzettingsvermogen",
            "info": "Negatieve feedback zien als positieve accumulator"
          },
          "ext": {
            "name": "Tijdig externe deskundigheid inroepen",
            "info": "Rekening houden met eigen sterktes en zwaktes"
          },
          "learn": {
            "name": "Levenslang leren",
            "info": "Feedback vertalen naar concrete leerpunten"
          }
        }
      },
      "qual": {
        "name": "Kwaliteitsvol handelen",
        "rows": {
          "build": {
            "name": "Een kwaliteitsvolle redenering onderbouwen, rekening houdend met beroepsspecifieke inzichten en ervaringen",
            "info": "Interdisciplinair verbanden leggen"
          },
          "perf": {
            "name": "Performant en functioneel handelen",
            "info": "Zelfstandig op zoek gaan naar een degelijke oplossing voor een gesteld probleem"
          },
          "sol": {
            "name": "Oplossingen leveren die gebruiksvriendelijk en flexibel zijn",
            "info": "Problemen analyseren"
          },
          "conf": {
            "name": "Handelen conform de regelgeving",
            "info": "Regelgeving onder begeleiding toepassen in een bepaalde context"
          },
          "cont": {
            "name": "Rekening houden met de bedrijfseconomische context",
            "info": "Notie hebben van de bedrijfsprocessen en de bedrijfseconomische context"
          },
          "qual": {
            "name": "Een kwaliteitszorgsysteem toepassen",
            "info": "Notie hebben van het bestaan van verschillende kwaliteitszorgsystemen"
          }
        }
      }
    }
  },
  "navigation": {
    "about": "Over mij",
    "competences": "Competenties",
    "projects": "Projecten",
    "resume": "CV"
  },
  "projects": {
    "title": "Projecten",
    "abc_cooking": {
      "pOne": "In oktober 2019 nam ik deel aan een hackathon die georganiseerd werd door IBM. De business case was om een standalone app te maken voor de Apple Watch. Ons idee was om een app te maken die je kon gebruiken bij het kopen van ingrediënten en koken van een gerecht.",
      "pTwo": "Je kon gerechten kiezen uit een online databank en de app helpt je dan bij het hele proces. Van het kopen van de juiste ingrediënten in de juiste hoeveelheden tot het koken zelf.",
      "pThree": "Om een gerecht te kiezen, kon je spreken tegen je horloge en dan werd er met behulp van Watson bepaald welk gerecht je wilde maken en voor hoeveel personen.",
      "pFour": "De naam ABC-cooking komt van Appetite, Buy, Cook. Je beslist dat je \"Appetite\" hebt en kiest een gerecht. Hierna word je automatisch naar de \"Buy\" stap geleid die je daarna weer tot bij \"Cook\" brengt."
    },
    "arnecrush": {
      "pOne": "Arnecrush is een passieproject dat ik heb gemaakt tijdens mijn eerste jaar Toegepaste Informatica. Dit was een website waarop mijn medestudenten spelletjes konden spelen. De bedoeling was dat alle assets in deze spelletjes gebaseerd waren op leerkrachten.",
      "pTwo": "De website, database en alle games werden gehost op een raspberry pie."
    },
    "snake": {
      "pOne": "Eén van mijn eerste programmeerprojecten was deze snake AI. Het programma speelde snake met behulp van Neural Networks en verbeterde zichzelf door weights en biases van vorige generaties over te erven.",
      "pTwo": "Het hele programma is in Python geschreven. Omwille van performantie, heb ik numpy gebruikt voor het vermenigvuldigen van matrices."
    },
    "novem": {
      "pOne": "Novem is een evaluatie-instrument dat oorspronkelijk ontwikkeld is voor scholen. Het is een manier om studenten te scoren op verschillende karakterkenmerken door hen vragenlijsten te laten invullen. Een kennis heeft mij gevraagd om deze applicatie te ontwikkelen.",
      "pTwo": "Aangezien beveiliging één van de belangrijkste onderdelen was van deze applicatie, heb ik besloten de applicatie met het Django Framework te maken.",
      "pThree": "Momenteel wordt deze applicatie getest in Belgische scholen."
    },
    "ticketgang": {
      "pOne": "In augustus 2019 heb ik, samen met een andere student, aan een app gewerkt voor TicketGang.",
      "pTwo": "De app moest gebruikt worden voor het scannen van tickets aan de ingang van grote evenementen. Ze kon niet enkel gebruikt worden om deze tickets te scannen, maar ook om verschillende scan-profielen op te stellen en een scan-crew te beheren.",
      "pThree": "De app is gemaakt met Xamarin en heeft een iOS en Android versie."
    },
    "stars_4_everyone": {
      "pOne": "Op school hebben we elk semester een projectweek. Deze projectweek mochten twee teams volgens het BDD-principe werken. Ik zat in één van deze teams.",
      "pTwo": "We moesten een applicatie maken waar gebruikers sterren konden geven aan hun collega's voor hulp bij projecten. De gebruikte technologieën waren niet echt modern, wat de uitdaging des te groter maakte. Het hele project is gemaakt met Java Servlets."
    }
  },
  "resume": {
    "under_header": "Programmeur - België",
    "skills": {
      "prot": "Netwerkprotocollen",
      "alg": "Algoritmen",
      "datas": "Datastructuren",
      "math": "Wiskunde",
      "teach": "Lesgeven",
      "leader": "Leiderschap"
    },
    "edu": {
      "title": "Opleiding",
      "ti": {
        "title": "Bachelor in de Toegepaste Informatica",
        "date": "2018 - Nu",
        "extra": "Gewogen gemiddelde: 83.7%"
      },
      "fys": {
        "title": "Bachelor in de Fysica",
        "date": "2016 - 2018",
        "extra": "Gestopt"
      }
    },
    "work": {
      "title": "Werkervaring",
      "ticketgang": {
        "date": "Augustus 2019",
        "description": "Had een maand om een cross-platform app te maken samen met een andere student. De app kon gebruikt worden om scan-profielen en -crews te beheren, en om bar- en QR-codes te scannen aan de ingang van evenementen. Alle data moest met behulp van een API naar de server gestuurd worden."
      }
    },
    "ex_cur": {
      "title": "Buitenschoolse activiteiten",
      "ibm_hack": {
        "date": "Oktober 2019",
        "description": "Deelgenomen aan een hackathon, georganiseerd door IBM.  De business case was om een standalone app te maken voor de Apple Watch. We hebben een app gebouwd waarbij je kon spreken tegen je horloge om ingrediënten voor een gerecht te ontdekken, live instructies kreeg tijdens het koken en online ingrediënten kon bestellen."
      },
      "progr_comp": {
        "title": "Vlaamse Programmeerwedstrijd",
        "date": "Maart 2019",
        "description": "Tweede plaats op de Vlaamse Programmeerwedstrijd."
      },
      "teach": {
        "title": "Monitoraat lessen",
        "description": "Enkele monitoraat-lessen gegeven over assembly, web-ontwikkeling en object-georiënteerd programmeren voor studenten in het jaar onder mij."
      },
      "chiro": {
        "date": "2015 - Nu",
        "description": "Groepsleiding en leiding bij Chiro Nemas Binkom."
      }
    },
    "contact": {
      "title": "Contact Informatie",
      "belg": "België"
    },
    "lang": {
      "title": "Talen",
      "nl": "Nederlands (Moedertaal)",
      "en": "Engels",
      "fr": "Frans"
    },
    "progr_lang": {
      "title": "Programmeertalen"
    },
    "fram": {
      "title": "Frameworks & Libraries"
    }
  }
}