{
  "about": {
    "title": "About me",
    "pOne": "I am Andreas Milants and I am a student Applied Information Technology at University College Leuven-Limburg.",
    "pTwo": "Most of my spare time is spent making lots of different applications. These range from making a simple website to working with Neural Networks.",
    "pThree": "The time that I've got left, I spend on my two hobbies: Chiro and football. I've been monitor at Chiro Nemas Binkom since 2015 and since 2018 I am head monitor."
  },
  "competences": {
    "matrix": "Click here for the competences matrix",
    "title": "Competences",
    "backend_dev": {
      "title": "Backend webdevelopment",
      "descr": "Advanced"
    },
    "frontend_dev": {
      "title": "Frontend webdevelopment",
      "descr": "Medium"
    },
    "app_dev": {
      "title": "App development",
      "descr": "Medium"
    },
    "algo": {
      "title": "Algorithms & Datastructures",
      "descr": "Advanced",
      "second_place": "Second place \"Vlaamse Programmeerwedstrijd\""
    },
    "databases": {
      "title": "Databases",
      "descr": "Medium"
    },
    "level": "Level",
    "exp": "Experience"
  },
  "navigation": {
    "about": "About me",
    "competences": "Competences",
    "projects": "Projects",
    "resume": "Resume"
  },
 "competencesMatrix": {
    "smallScreen": "This competences matrix might not be shown correctly on your screen. Use a wider screen.",
    "levels": {
      "el": "Elementary",
      "gr": "Growth",
      "in": "Integration",
      "ex": "Expert"
    },
    "level": "Level",
    "info": "Info",
    "competences": {
      "dataHandle": {
        "name": "Handling data",
        "rows": {
          "collect": {
            "name": "Collecting data",
            "info": "Structure the data"
          },
          "model": {
            "name": "Model data",
            "info": "Model data according to a relevant model"
          },
          "connect": {
            "name": "Make connections",
            "info": "Apply required relationships independently"
          },
          "save": {
            "name": "Save data",
            "info": "Save data and make backup copies according to a provided procedure"
          },
          "access": {
            "name": "Provide data",
            "info": "Know existing forms of presentation"
          }
        }
      },
      "analyze": {
        "name": "Analyze",
        "rows": {
          "identify": {
            "name": "Identify information needs of an organization",
            "info": "Independently document information about the mission of an organization"
          },
          "translate": {
            "name": "Translating the information needs of an organization into concepts, schedules and relationships",
            "info": "Independent use of a method to structure data"
          },
          "formulate": {
            "name": "Documenting / formulating possible IT solutions",
            "info": "Collecting possible solutions to similar existing problems"
          },
          "eval": {
            "name": "Evaluating possible IT solutions",
            "info": "Having an understanding of the available criteria"
          },
          "test": {
            "name": "Establishing test procedures for new IT solutions",
            "info": "Determining possible concrete working methods independently for each of the parties"
          }
        }
      },
      "solve": {
        "name": "Working out solutions",
        "rows": {
          "progr": {
            "name": "Programming new IT solutions",
            "info": "Applying complex algorithms independently"
          },
          "impl": {
            "name": "Implementing new IT solutions",
            "info": "Deploying the new application"
          },
          "doc": {
            "name": "Documenting new IT solutions",
            "info": "Expressing thoughts correctly"
          },
          "test": {
            "name": "Testng new IT solutions",
            "info": "Validating the integration"
          }
        }
      },
      "manage": {
        "name": "Manage",
        "rows": {
          "conf": {
            "name": "Configure, secure and adapt IT solutions",
            "info": "Setting up IT solutions based on standard documentation"
          }
        }
      },
      "project": {
        "name": "Working project-based",
        "rows": {
          "split": {
            "name": "Splitting the project into tasks and subtasks",
            "info": "Understanding the usefulness of a step-by-step approach"
          },
          "plan": {
            "name": "Draw up schedules",
            "info": "Understanding the importance of a time schedule"
          },
          "fol": {
            "name": "Follow up on a project",
            "info": "Checking whether the imposed deadlines are met for a simple assignment, under supervision"
          },
          "mul": {
            "name": "Working in a multidisciplinary and / or multicultural team, as a team member or project leader",
            "info": "Understanding the different roles of the participants in a project"
          }
        }
      },
      "comm": {
        "name": "Communicate",
        "rows": {
          "comm": {
            "name": "Communicate orally and in writing in Dutch and at least one foreign language",
            "info": "Using an attractive and motivating writing style"
          },
          "suit": {
            "name": "Employ appropriate communication techniques",
            "info": "Applying meeting and reporting techniques"
          },
          "par": {
            "name": "Participate in meetings as a member or as chairman",
            "info": "Conducting meetings with Chiro Nemas Binkom, member youth council Lubbeek"
          },
          "teach": {
            "name": "Training and guiding people",
            "info": "Formulating suggestions and tips"
          }
        }
      },
      "adapt": {
        "name": "Adjusting own behavior",
        "rows": {
          "eval": {
            "name": "Critically evaluate and adjust one's own performance",
            "info": "Timely searching for an alternative solution / approach if the chosen approach is not suitable"
          },
          "act": {
            "name": "Conduct yourself socially responsible",
            "info": "Compliance with the ethics specific to the function, role or level"
          },
          "cre": {
            "name": "Acting with a sense of initiative and creative innovation",
            "info": "Taking initiative to innovate where the outcome is not known and predictable"
          },
          "ass": {
            "name": "Acting assertively and taking into account the interests of the parties involved",
            "info": "Supporting your own views with arguments"
          },
          "stress": {
            "name": "Execute assignments with perseverance",
            "info": "Thinking of negative feedback as a positive accumulator"
          },
          "ext": {
            "name": "Call in external expertise in a timely manner",
            "info": "Taking your own strengths and weaknesses into account"
          },
          "learn": {
            "name": "Lifelong learning",
            "info": "Translating feedback into concrete learning points"
          }
        }
      },
      "qual": {
        "name": "Quality action",
        "rows": {
          "build": {
            "name": "Substantiate high-quality reasoning, taking into account profession-specific insights and experiences",
            "info": "Making interdisciplinary connections"
          },
          "perf": {
            "name": "Acting efficiently and functionally",
            "info": "Independently looking for a solid solution to a posed problem"
          },
          "sol": {
            "name": "Provide solutions that are user-friendly and flexible",
            "info": "Analyzing problems"
          },
          "conf": {
            "name": "Act in accordance with regulations",
            "info": "Applying supervised regulations in a specific context"
          },
          "cont": {
            "name": "Taking into account the business context",
            "info": "Having a notion of the business processes and the business context"
          },
          "qual": {
            "name": "Applying a quality assurance system",
            "info": "Having a notion of the existence of different quality assurance systems"
          }
        }
      }
    }
  },
  "projects": {
    "title": "Projects",
    "abc_cooking": {
      "pOne": "In October 2019 I participated in a hackathon organised by IBM. The business case was to make a standalone Apple Watch app. We built an app that you could use to find out ingredients for a dish and help you prepare it.",
      "pTwo": "You could choose dishes from an online database and the app would help you through the entire process. You'd start with buying the ingredients and end with your prepared meal.",
      "pThree": "To choose a dish, you could speak to your watch and after that, with the help of the Watson API, we determined what it was you wanted to prepare and for how many people.",
      "pFour": "The name ABC-Cooking is an acronym for Appetite, Buy, Cook. When you decide you have an appetite, you choose a dish. The app would then lead you to the buy stage and eventually help you cook your meal."
    },
    "arnecrush": {
      "pOne": "Arnecrush is a passion-project I made in my first year of Applied Information Technology. It was a website where my fellow students could play games. The goal was to get as many in-game assets that were based on teachers.",
      "pTwo": "The website, database and all games were hosted on a raspberry pie."
    },
    "snake": {
      "pOne": "One of my first programming projects ever was this snake AI. The program played snake using Neural Networks and improved upon itself by inheriting weights and biases from previous generations.",
      "pTwo": "The entire program was written in Python. For performance reasons I used numpy for all of the matrix multiplications."
    },
    "novem": {
      "pOne": "Novem is an evaluation instrument that was initially developed for schools. It is a way to score students on certain characteristic aspects by letting them fill in personal surveys. I was asked to develop an application for this by an acquaintance who developed these surveys.",
      "pTwo": "Since security was key, I built the entire application with the Django Framework.",
      "pThree": "This application is currently being tested in schools in Belgium."
    },
    "ticketgang": {
      "pOne": "In August 2019, together with another student, I worked on an app for TicketGang.",
      "pTwo": "The app would be used to scan tickets at the entrance of big events. Not only could you use it to scan tickets, it could also be used to set up different scan-profiles and manage a scancrew.",
      "pThree": "The app was made with Xamarin and has a version for iOS and Android."
    },
    "stars_4_everyone": {
      "pOne": "At school we have a project week every semester. This project week, two teams would have the opportunity to work with the BDD-principle. I was in one of those teams.",
      "pTwo": "We had to build an application where people could give stars to their co-workers for help on projects. The technologies we used in this project were not very modern, which made it a bigger challenge. The entire project was built with Java Servlets."
    }
  },
  "resume": {
    "under_header": "Programmer - Belgium",
    "skills": {
      "prot": "Networking protocols",
      "alg": "Algorithms",
      "datas": "Data structures",
      "math": "Mathematics",
      "teach": "Teaching",
      "leader": "Leadership"
    },
    "edu": {
      "title": "Education",
      "ti": {
        "title": "Bachelor in Applied Information Technology",
        "date": "2018 - Present",
        "extra": "Weighted average: 83.7%"
      },
      "fys": {
        "title": "Bachelor in Physics",
        "date": "2016 - 2018",
        "extra": "Aborted"
      }
    },
    "work": {
      "title": "Work Experience",
      "ticketgang": {
        "date": "August 2019",
        "description": "Had one month to build a cross-platform app with another student. The app could be used to manage scan-profiles and -crews, and to scan bar- and QRcodes on tickets at the entrance of events. All data had to be fetched from a database and scanned tickets pushed to the server when an internet connection is available."
      }
    },
    "ex_cur": {
      "title": "Extracurricular Activities",
      "ibm_hack": {
        "date": "October 2019",
        "description": "Participated in a hackathon organised by IBM. The business case was to make a standalone Apple Watch app. We built an app that you could talk to to find out ingredients and recipes for a dish, give you live instructions while cooking, and order ingredients online"
      },
      "progr_comp": {
        "title": "Flemish Programming Competition",
        "date": "March 2019",
        "description": "2nd place at the \"Vlaamse Programmeerwedstrijd\", a programming competition for people who live in Flanders."
      },
      "teach": {
        "title": "Remedial teaching",
        "description": "Gave remedial lessons on assembly, web-development and object oriented programming to students in the year below me."
      },
      "chiro": {
        "date": "2015 - Present",
        "description": "Head monitor and monitor at Chiro Nemas Binkom."
      }
    },
    "contact": {
      "title": "Contact Information",
      "belg": "Belgium"
    },
    "lang": {
      "title": "Languages",
      "nl": "Dutch (Native)",
      "en": "English",
      "fr": "French"
    },
    "progr_lang": {
      "title": "Programming Languages"
    },
    "fram": {
      "title": "Frameworks & Libraries"
    }
  }
}