{
  "about": {
    "title": "About me",
    "pOne": "I am Andreas Milants and I am a student Applied Information Technology at University College Leuven-Limburg.",
    "pTwo": "Most of my spare time is spent making lots of different applications. These range from making a simple website to working with Neural Networks.",
    "pThree": "The time that I've got left, I spend on my two hobbies: Chiro and football. I've been monitor at Chiro Nemas Binkom since 2015 and since 2018 I am head monitor."
  },
  "competences": {
    "title": "Competences",
    "backend_dev": {
      "title": "Backend webdevelopment",
      "descr": "Advanced"
    },
    "frontend_dev": {
      "title": "Frontend webdevelopment",
      "descr": "Medium"
    },
    "app_dev": {
      "title": "App development",
      "descr": "Medium"
    },
    "algo": {
      "title": "Algorithms & Datastructures",
      "descr": "Advanced",
      "second_place": "Second place \"Vlaamse Programmeerwedstrijd\""
    },
    "databases": {
      "title": "Databases",
      "descr": "Medium"
    },
    "level": "Level",
    "exp": "Experience"
  },
  "navigation": {
    "about": "About me",
    "competences": "Competences",
    "projects": "Projects",
    "resume": "Resume"
  },
  "projects": {
    "title": "Projects",
    "abc_cooking": {
      "pOne": "In October 2019 I participated in a hackathon organised by IBM. The business case was to make a standalone Apple Watch app. We built an app that you could use to find out ingredients for a dish and help you prepare it.",
      "pTwo": "You could choose dishes from an online database and the app would help you through the entire process. You'd start with buying the ingredients and end with your prepared meal.",
      "pThree": "To choose a dish, you could speak to your watch and after that, with the help of the Watson API, we determined what it was you wanted to prepare and for how many people.",
      "pFour": "The name ABC-Cooking is an acronym for Appetite, Buy, Cook. When you decide you have an appetite, you choose a dish. The app would then lead you to the buy stage and eventually help you cook your meal."
    },
    "arnecrush": {
      "pOne": "Arnecrush is a passion-project I made in my first year of Applied Information Technology. It was a website where my fellow students could play games. The goal was to get as many in-game assets that were based on teachers.",
      "pTwo": "The website, database and all games were hosted on a raspberry pie."
    },
    "snake": {
      "pOne": "One of my first programming projects ever was this snake AI. The program played snake using Neural Networks and improved upon itself by inheriting weights and biases from previous generations.",
      "pTwo": "The entire program was written in Python. For performance reasons I used numpy for all of the matrix multiplications."
    },
    "novem": {
      "pOne": "Novem is an evaluation instrument that was initially developed for schools. It is a way to score students on certain characteristic aspects by letting them fill in personal surveys. I was asked to develop an application for this by an acquaintance who developed these surveys.",
      "pTwo": "Since security was key, I built the entire application with the Django Framework.",
      "pThree": "This application is currently being tested in schools in Belgium."
    },
    "ticketgang": {
      "pOne": "In August 2019, together with another student, I worked on an app for TicketGang.",
      "pTwo": "The app would be used to scan tickets at the entrance of big events. Not only could you use it to scan tickets, it could also be used to set up different scan-profiles and manage a scancrew.",
      "pThree": "The app was made with Xamarin and has a version for iOS and Android."
    },
    "stars_4_everyone": {
      "pOne": "At school we have a project week every semester. This project week, two teams would have the opportunity to work with the BDD-principle. I was in one of those teams.",
      "pTwo": "We had to build an application where people could give stars to their co-workers for help on projects. The technologies we used in this project were not very modern, which made it a bigger challenge. The entire project was built with Java Servlets."
    },
    "cnb": {
      "pOne": "In 2020 we (Chiro Nemas Binkom) decided we needed a new website. Untill this moment we were running a wordpress website, but we wanted to create an easier way for our members to enroll.",
      "pTwo": "I decided to build a new website in Django and host it on AWS.",
      "pThree": "The project contains a custom built CMS, photo-gallery application (The first version of my own django package django-photos) and lots of extra features.",
      "pFourOne": "The website is hosted on AWS Elastic Beanstalk in a docker environment. And is currently being tested on the domain ",
      "pFourTwo": ". We are planning on migrating to our real domain in the next few weeks."
    }
  },
  "resume": {
    "under_header": "Software Developer - Belgium",
    "skills": {
      "prot": "Networking protocols",
      "alg": "Algorithms",
      "datas": "Data structures",
      "math": "Mathematics",
      "teach": "Teaching",
      "leader": "Leadership"
    },
    "edu": {
      "title": "Education",
      "ti": {
        "title": "Bachelor in Applied Information Technology",
        "date": "2018 - Present",
        "extra": "Weighted average: 83.7%"
      },
      "fys": {
        "title": "Bachelor in Physics",
        "date": "2016 - 2018",
        "extra": "Aborted"
      }
    },
    "work": {
      "title": "Work Experience",
      "ticketgang": {
        "date": "August 2019, August 2020",
        "description": "In 2019, I built an app that could be used to manage scan-profiles and -crews, and to scan tickets at the entrance of events. In 2020, I built an app to buy, reserve and manage tickets for events."
      }
    },
    "ex_cur": {
      "title": "Extracurricular Activities",
      "ibm_hack": {
        "date": "October 2019",
        "description": "Participated in a hackathon organised by IBM. The business case was to make a standalone Apple Watch app. We built an app that you could talk to to find out ingredients and recipes for a dish, give you live instructions while cooking, and order ingredients online"
      },
      "progr_comp": {
        "title": "Flemish Programming Competition",
        "date": "March 2019",
        "description": "2nd place at the \"Vlaamse Programmeerwedstrijd\", a programming competition for people who live in Flanders."
      },
      "teach": {
        "title": "Remedial teaching",
        "description": "Gave remedial lessons on assembly, web-development and object oriented programming to first- and second-year students of Applied Information Technology."
      },
      "chiro": {
        "date": "2015 - Present",
        "description": "Head monitor and monitor at Chiro Nemas Binkom."
      }
    },
    "contact": {
      "title": "Contact Information",
      "belg": "Belgium"
    },
    "lang": {
      "title": "Languages",
      "nl": "Dutch (Native)",
      "en": "English",
      "fr": "French"
    },
    "progr_lang": {
      "title": "Programming Languages"
    },
    "fram": {
      "title": "Frameworks & Libraries"
    }
  }
}
