{
  "about": {
    "title": "About me",
    "pOne": "I am Andreas Milants and I am a student Applied Information Technology at University College Leuven-Limburg.",
    "pTwo": "Most of my spare time is spent making lots of different applications. These range from making a simple website to working with Neural Networks.",
    "pThree": "The time that I've got left, I spend on my two hobbies: Chiro and football. I've been monitor at Chiro Nemas Binkom since 2015 and since 2018 I am head monitor."
  },
  "competences": {
    "title": "Skills",
    "backend_dev": {
      "title": "Backend webdevelopment",
      "descr": "Advanced"
    },
    "frontend_dev": {
      "title": "Frontend webdevelopment",
      "descr": "Medium"
    },
    "app_dev": {
      "title": "App development",
      "descr": "Medium"
    },
    "algo": {
      "title": "Algorithms & Datastructures",
      "descr": "Advanced",
      "second_place": "Second place \"Vlaamse Programmeerwedstrijd\""
    },
    "databases": {
      "title": "Databases",
      "descr": "Medium"
    },
    "level": "Level",
    "exp": "Experience"
  },
  "navigation": {
    "about": "About me",
    "competences": "Skills",
    "projects": "Projects",
    "resume": "Resume"
  },
  "projects": {
    "title": "Projects",
    "abc_cooking": {
      "pOne": "In October 2019 I participated in a hackathon organised by IBM. The business case was to make a standalone Apple Watch app. We built an app that you could use to find out ingredients for a dish and help you prepare it.",
      "pTwo": "You could choose dishes from an online database and the app would help you through the entire process. You'd start with buying the ingredients and end with your prepared meal.",
      "pThree": "To choose a dish, you could speak to your watch and after that, with the help of the Watson API, we determined what it was you wanted to prepare and for how many people.",
      "pFour": "The name ABC-Cooking is an acronym for Appetite, Buy, Cook. When you decide you have an appetite, you choose a dish. The app would then lead you to the buy stage and eventually help you cook your meal."
    },
    "abc_cooking2": {
      "pOne": "For a course called 'Mobile Applications', I had to build a mobile app. I thought about the ABC cooking watch-app I made earlier and thought it to be a great project to work on again. This time though, everything is much more detailed and the app became a finished product.",
      "pTwo": "The app was entirely made in Flutter, with Django as backend."
    },
    "arnecrush": {
      "pOne": "Arnecrush is a passion-project I made in my first year of Applied Information Technology. It was a website where my fellow students could play games. The goal was to get as many in-game assets that were based on teachers.",
      "pTwo": "The website, database and all games were hosted on a raspberry pie."
    },
    "snake": {
      "pOne": "One of my first programming projects ever was this snake AI. The program played snake using Neural Networks and improved upon itself by inheriting weights and biases from previous generations.",
      "pTwo": "The entire program was written in Python. For performance reasons I used numpy for all of the matrix multiplications."
    },
    "novem": {
      "pOne": "Novem is an evaluation instrument that was initially developed for schools. It is a way to score students on certain characteristic aspects by letting them fill in personal surveys. I was asked to develop an application for this by an acquaintance who developed these surveys.",
      "pTwo": "Since security was key, I built the entire application with the Django Framework.",
      "pThree": "This application is currently being tested in schools in Belgium."
    },
    "ticketgang": {
      "pOne": "In August 2019, together with another student, I worked on an app for TicketGang.",
      "pTwo": "The app would be used to scan tickets at the entrance of big events. Not only could you use it to scan tickets, it could also be used to set up different scan-profiles and manage a scancrew.",
      "pThree": "The app was made with Xamarin and has a version for iOS and Android.",
      "pFour": "In 2020 I once again went to work for TicketGang for a month. This time I got the assignment to build an app to buy, sell and reserve tickets."
    },
    "stars_4_everyone": {
      "pOne": "At school we have a project week every semester. This project week, two teams would have the opportunity to work with the BDD-principle. I was in one of those teams.",
      "pTwo": "We had to build an application where people could give stars to their co-workers for help on projects. The technologies we used in this project were not very modern, which made it a bigger challenge. The entire project was built with Java Servlets."
    },
    "cnb": {
      "pOne": "In 2020 we (Chiro Nemas Binkom) decided we needed a new website. Untill this moment we were running a wordpress website, but we wanted to create an easier way for our members to enroll.",
      "pTwo": "I decided to build a new website in Django and host it on AWS.",
      "pThree": "The project contains a custom built CMS, photo-gallery application and lots of extra features.",
      "pFourOne": "The website is hosted on AWS Elastic Beanstalk in a docker environment, and will become available on ",
      "pFourTwo": " in the near future."
    },
    "stratvision": {
      "pOne": "As a final project in my bachelor studies, I built a webapplication for Stratvision. Stratvision is a businessgame that is played in teams of international students.",
      "pTwo": "The goal of the project was to make the entire game editable by people without any programming knowledge. As a solution to this problem I invented the node-editor you can see in the picture above. The node-editor consists of different types of nodes who allow you to build the logic for an entire businessgame, all from your browser.",
      "pThree": "When you've changed your businesslogic, you have to be able to change the way in which things like reports and charts are generated. These can be easily edited as well through the website.",
      "pFour": "The result is a completely finished product, with which students can play a businessgame. Between rounds, reports are generated automatically by interpreting the logic that was built by an administrator."
    },
    "scrabble": {
      "pOne": "Fill in the board, enter your available tiles and find the solution which gives you the most Scrabble points! (This uses a Dutch dictionary)"
    }
  },
  "resume": {
    "under_header": "Software Developer - Belgium",
    "skills": {
      "prot": "Networking protocols",
      "alg": "Algorithms",
      "datas": "Data structures",
      "math": "Mathematics",
      "teach": "Teaching",
      "leader": "Leadership",
      "stock": "Stock Market"
    },
    "edu": {
      "title": "Education",
      "ti": {
        "title": "Bachelor in Applied Information Technology"
      },
      "fys": {
        "title": "Bachelor in Physics",
        "extra": "Aborted"
      }
    },
    "work": {
      "title": "Work Experience",
      "ticketgang": {
        "date": "August 2019 & August 2020",
        "description": "Built an app for event-organizers and another one for customers to buy tickets."
      },
      "riskconcile": {
        "date": "March 2021 - Present",
        "description": "As a full stack developer I am responsible for lots of different applications in the front-end and backend."
      }
    },
    "ex_cur": {
      "title": "Extracurricular Activities",
      "ibm_hack": {
        "date": "October 2019",
        "description": "Participated in a hackathon organised by IBM. The business case was to make a standalone Apple Watch app. We built an app that you could talk to to find out ingredients and recipes for a dish, give you live instructions while cooking, and order ingredients online"
      },
      "progr_comp": {
        "title": "Flemish Programming Competition",
        "date": "March 2019",
        "description": "2nd place at the \"Vlaamse Programmeerwedstrijd\", a programming competition for people who live in Flanders."
      },
      "teach": {
        "title": "Remedial teaching",
        "description": "Gave remedial lessons on assembly, trees & graphs, web-development and object oriented programming to first- and second-year students of Applied Information Technology."
      },
      "chiro": {
        "description": "Head monitor and monitor at Chiro Nemas Binkom."
      }
    },
    "contact": {
      "title": "Contact Information",
      "belg": "Belgium"
    },
    "lang": {
      "title": "Languages",
      "nl": "Dutch (Native)",
      "en": "English",
      "fr": "French"
    },
    "progr_lang": {
      "title": "Programming Languages"
    },
    "fram": {
      "title": "Frameworks & Libraries"
    }
  }
}
